# 从花舞RANK推荐表搬运到WikiRANK推荐表的脚本
# 输入为rank_input.txt
# 输出为rank.txt
import requests


def get_page():
    page = requests.get(
        "https://docs.qq.com/sheet/DYWxDbGdRYWV1bHFv?tab=6lwsay")
    page = page.content
    page = str(page.decode("utf-8"))
    with open("./rank.txt", "a+", encoding="utf-8") as f:
        f.write(page)


kv = {
    "空花(大江户)": "空花（大江户）",
    "怜(新年)": "怜（新年）",
    "日和莉(新年)": "日和莉（新年）",
    "妮侬(大江户)": "妮侬（大江户）",
    "真琴(夏日)": "真琴（夏日）",
    "惠理子(情人节)": "惠理子（情人节）",
    "绫音(圣诞节)": "绫音（圣诞节）",
    "珠希(夏日)": "珠希（夏日）",
    "朱希": "珠希",
    "佩可莉姆(夏日)": " 佩可莉姆（夏日）",
    "克里斯缇娜": "克莉丝提娜",
    "胡桃(圣诞节)": "胡桃（圣诞节）",
    "静流(情人节)": "静流（情人节）",
    "香织(夏日)": "香织（夏日）",
    "忍(万圣节)": "忍（万圣节）",
    "美冬(夏日)": "美冬（夏日）",
    "古蕾娅": "古蕾雅",
    "环奈(振袖)": "环奈（振袖）",
    "可可萝(夏日)": " 可可萝（夏日）",
    "蕾姆": "雷姆",
    "咲恋(夏日)": "咲恋（夏日）",
    "宫子(万圣节)": "宫子（万圣节）",
    "碧(插班生)": "碧（插班生）",
    "玲奈": "铃奈",
    "铃奈(夏日)": "铃奈（夏日）",
    "伊绪(夏日)": "伊绪（夏日）",
    "霞": "香澄",
    "优衣(新年)": "优衣（新年）",
    "千歌(圣诞节)": "千歌（圣诞节）",
    "铃莓(夏日)": "铃莓（夏日）",
    "凯露(夏日)": "凯露（夏日）",
    "真步(夏日)": "真步（夏日）",
    "美咲(万圣节)": "美咲（万圣节）",
    "镜华(万圣节)": "镜华（万圣节）",
    "未奏希(万圣节)": "未奏希（万圣节）",
    "美美(万圣节)": "美美（万圣节）",
    "克萝依": "克罗依",
    "可可萝(新年)": "可可萝（新年）",
    "凯露(新年)": "凯露（新年）",
    "栞(魔法少女)": "栞（魔法少女）",
    "铃莓(新年)": "铃莓（新年）",
    "霞(魔法少女)": "香澄（魔法少女）",
    "佩可莉姆(公主)": "佩可莉姆（公主）",
    "未央": "未央（偶像大师）",
    "凜(偶像大师)": "凛（偶像大师）",
    "卯月(偶像大师)": "卯月（偶像大师）",
    "未央(偶像大师)": "未央（偶像大师）",
    "克里斯缇娜（圣诞节）": "克莉丝提娜（圣诞节）",
    "可可萝(公主)": "可可萝（公主）",
    "真阳(游侠)": "真阳（游骑兵）",
    "铃(游侠)": "铃（游骑兵）",
    "璃乃(仙境)": "璃乃（仙境）",
    "璃乃(仙境)兔弓": "璃乃（仙境）",
    "步美(仙境)": "步美（仙境）",
    "步美(仙境)路人兔 兔人妹": "步美（仙境）",
    "优衣(公主)": "优衣（公主）",
    "流夏(夏日)": "流夏（夏日）",
    "杏奈(夏日)": "杏奈（夏日）",
    "七七香(夏日)": "七七香（夏日）",
    "纯(夏日)": "纯（夏日）",
    "初音(夏日)": "初音（夏日）",
    "美里(夏日)": "美里（夏日）",
    "茜里(天使)": "茜里（天使）",
    "依里(天使)": "依里（天使）"
}

# 备忘：需要修改的角色：克莉丝提娜（圣诞节），惠理子（情人节），伊莉亚（圣诞节）
with open("./rank_input.txt", encoding="utf-8") as rf:
    with open("./rank.txt", "w", encoding="utf-8") as wf:
        lines = ""
        for line in rf:
            lines += line
        lines = lines.split("图片\t")
        for line in lines:
            line = line[:-1].replace("\n", "<br/>")
            if line == "":
                continue
            line = line.split("\t")
            # print(line)
            wf.write("{{RANK推荐/行|")
            name_split = line[0].split("<br/>")
            name = name_split[0] if len(name_split) == 1 else "".join(name_split[:-1])
            # 角色
            wf.write(kv.get(name, name))
            # 定位 会战 竞技进攻 竞技防守 六星特性 星级 专武等级 专武解锁 升级 培养顺序
            str2 = "|"+line[3]+"|"+line[4]+"|"+line[5]+"|"+line[6]+"|"+line[7]+"|"+line[8]+"|"+line[9]+"|"+line[10]+"|"+line[11]+"|"+line[12]
            # 花舞RANK推荐U 说明/备注V
            str2 += "|"+line[19]+"|"+line[20]+"}}\n"
            # str2.replace("~~~", "<nowiki>~~~</nowiki>")
            wf.write(str2)
            # break
